#include <iostream>
#include <string>

using namespace std;

class Player {
// Все, что идет ниже, доступно только внутри этого класса (по умолчанию для class)
private:
    int hp; // Здоровье скрыто от внешнего мира, чтобы его не сломали

// А вот это доступно всем снаружи
public:
    string name;

    // Метод для безопасной установки здоровья
    void setHp(int health) {
        if (health < 0) {
            hp = 0; // Защищаем данные от отрицательных чисел
        } else {
            hp = health;
        }
    }

// Геттер для получения здоровья наружу (прикол в том что злоумышленик его изменить не сможет поскольку это лишь копия числа)
    int getHp() {
        return hp;
    }

    void introduce() {
        cout << "Игрок: " << name << ", HP: " << hp << endl;
    }
};

int main() {
    Player p1;
    p1.name = "Stirner"; // Ошибки нет, поле name — public

    // p1.hp = 100; // ОШИБКА КОМПИЛЯЦИИ! Переменная hp — private, снаружи к ней не подступиться.

    // Правильный путь — через публичные функции (геттеры и сеттеры):
    p1.setHp(100); 
    p1.introduce();

    // Используем метод getHp() в main, так как напрямую p1.hp взять нельзя
    cout << "Текущее здоровье через геттер: " << p1.getHp() << endl;

    return 0;
}